xml/8.查询全部发票request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:con="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/tike/cont/ws/ConsultaLR.xsd"
                  xmlns:sum="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/tike/cont/ws/SuministroInformacion.xsd">
  <soapenv:Header/>
  <soapenv:Body>
    <con:ConsultaFactuSistemaFacturacion>
      <con:Cabecera>
        <sum:IDVersion>1.0</sum:IDVersion>
        <sum:ObligadoEmision>
          <sum:NombreRazon>SOFTCRAFTER S.L.</sum:NombreRazon>
          <sum:NIF>B56803240</sum:NIF>
        </sum:ObligadoEmision>
      </con:Cabecera>
      <con:FiltroConsulta>
        <con:PeriodoImputacion>
          <sum:Ejercicio>2025</sum:Ejercicio>
          <sum:Periodo>06</sum:Periodo>
        </con:PeriodoImputacion>
        <con:ClavePaginacion>
          <sum:IDEmisorFactura>B56803240</sum:IDEmisorFactura>
          <sum:NumSerieFactura>1000</sum:NumSerieFactura>
          <sum:FechaExpedicionFactura>25-06-2025</sum:FechaExpedicionFactura>
        </con:ClavePaginacion>
      </con:FiltroConsulta>
    </con:ConsultaFactuSistemaFacturacion>
  </soapenv:Body>
</soapenv:Envelope>