tests/sampleData01.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/tike/cont/ws/SuministroInformacion.xsd" xmlns:ns2="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/tike/cont/ws/SuministroLR.xsd"><SOAP-ENV:Body><ns2:RegFactuSistemaFacturacion><ns2:Cabecera><ns1:ObligadoEmision><ns1:NombreRazon>EIDAS CERTIFICADO PRUEBAS</ns1:NombreRazon><ns1:NIF>99999972C</ns1:NIF></ns1:ObligadoEmision></ns2:Cabecera><ns2:RegistroFactura><ns1:RegistroAlta><ns1:IDVersion>1.0</ns1:IDVersion><ns1:IDFactura><ns1:IDEmisorFactura>99999972C</ns1:IDEmisorFactura><ns1:NumSerieFactura>A/2025012345</ns1:NumSerieFactura><ns1:FechaExpedicionFactura>22-03-2025</ns1:FechaExpedicionFactura></ns1:IDFactura><ns1:NombreRazonEmisor>EIDAS CERTIFICADO PRUEBAS</ns1:NombreRazonEmisor><ns1:TipoFactura>F1</ns1:TipoFactura><ns1:DescripcionOperacion>Factura de venta</ns1:DescripcionOperacion><ns1:Destinatarios><ns1:IDDestinatario><ns1:NombreRazon>Cliente Físico</ns1:NombreRazon><ns1:NIF>Z5432106V</ns1:NIF></ns1:IDDestinatario></ns1:Destinatarios><ns1:Desglose><ns1:DetalleDesglose><ns1:ClaveRegimen>01</ns1:ClaveRegimen><ns1:CalificacionOperacion>S1</ns1:CalificacionOperacion><ns1:TipoImpositivo>4.00</ns1:TipoImpositivo><ns1:BaseImponibleOimporteNoSujeto>10.00</ns1:BaseImponibleOimporteNoSujeto><ns1:CuotaRepercutida>0.40</ns1:CuotaRepercutida></ns1:DetalleDesglose><ns1:DetalleDesglose><ns1:ClaveRegimen>01</ns1:ClaveRegimen><ns1:CalificacionOperacion>S1</ns1:CalificacionOperacion><ns1:TipoImpositivo>21.00</ns1:TipoImpositivo><ns1:BaseImponibleOimporteNoSujeto>100.00</ns1:BaseImponibleOimporteNoSujeto><ns1:CuotaRepercutida>21.00</ns1:CuotaRepercutida></ns1:DetalleDesglose></ns1:Desglose><ns1:CuotaTotal>21.40</ns1:CuotaTotal><ns1:ImporteTotal>131.40</ns1:ImporteTotal><ns1:Encadenamiento><ns1:RegistroAnterior><ns1:IDEmisorFactura>99999972C</ns1:IDEmisorFactura><ns1:NumSerieFactura>A/2025012344</ns1:NumSerieFactura><ns1:FechaExpedicionFactura>22-03-2025</ns1:FechaExpedicionFactura><ns1:Huella>3C464DAF61ACB827C65FDA19F352A4E3BDC2C640E9E9FC4CC058073F38F12F60</ns1:Huella></ns1:RegistroAnterior></ns1:Encadenamiento><ns1:SistemaInformatico><ns1:NombreRazon>11111111H</ns1:NombreRazon><ns1:NIF>11111111H</ns1:NIF><ns1:NombreSistemaInformatico>Open Verifactu API</ns1:NombreSistemaInformatico><ns1:IdSistemaInformatico>01</ns1:IdSistemaInformatico><ns1:Version>1.0.0</ns1:Version><ns1:NumeroInstalacion>company-01</ns1:NumeroInstalacion><ns1:TipoUsoPosibleSoloVerifactu>S</ns1:TipoUsoPosibleSoloVerifactu><ns1:TipoUsoPosibleMultiOT>N</ns1:TipoUsoPosibleMultiOT><ns1:IndicadorMultiplesOT>N</ns1:IndicadorMultiplesOT></ns1:SistemaInformatico><ns1:FechaHoraHusoGenRegistro>2025-03-22T13:10:37+00:00</ns1:FechaHoraHusoGenRegistro><ns1:TipoHuella>01</ns1:TipoHuella><ns1:Huella>73238806452AEAD89CC3A97DDAF2F5BA986BBC7957CF30E8C888B2F9EBE228A0</ns1:Huella></ns1:RegistroAlta></ns2:RegistroFactura></ns2:RegFactuSistemaFacturacion></SOAP-ENV:Body></SOAP-ENV:Envelope>
